
#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма) Экспорт 
 
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" 
		ИЛИ ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" 
		ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		
		СоздатьПолеКонтактноеЛицо(Форма.Элементы, Форма.Элементы.ГруппаШапкаПраво);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		
		СоздатьПолеКонтактноеЛицо(Форма.Элементы, , Форма.Элементы.Основание);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда	
		
		СоздатьПолеКонтактноеЛицо(Форма.Элементы, , Форма.Элементы.СуммаДокумента);
		
	КонецЕсли; 
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		
		СоздатьПолеСкидкиИКомандуПересчета(Форма);
		
	КонецЕсли;	
 
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Программное добавление элемента на форму документа
//
// Параметры:
//  Элементы - ВсеЭлементыФормы - Коллекция всех элементов формы клиентского приложения
//                 
//  Родитель - ГруппаФормы, Неопределено - Родитель для добавляемого элемента
//                
//  Элемент - ПолеФормы, Неопределено - Элемент, перед которым должен быть вставлен новый элемент
//
Процедура СоздатьПолеКонтактноеЛицо(Элементы, Родитель = Неопределено, Элемент = Неопределено)

	ПолеВвода = Элементы.Вставить("dgv_КонтактноеЛицо", Тип("ПолеФормы"), Родитель, Элемент);
	ПолеВвода.ПутьКДанным = "Объект.dgv_КонтактноеЛицо";
	ПолеВвода.Вид         = ВидПоляФормы.ПолеВвода;

КонецПроцедуры

#КонецОбласти
